In this experiment I will look at the "Where it pays to Attend College?" dataset, and try to identfiy patterns by looking at salary data, and the type of university students attended. 

Furthe—Ä clarifications on the data will follow in the following lines.

Since this is one of my first truly independent dataset anayses, some rookies mistakes are to be expected

I will start by uploading a few of the more popular libraries, but will likely come back to update that list.

In [90]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:90% !important; }</style>"))

%matplotlib inline

## Import the data

The data is storred in 3 seperate csv files.

In [2]:
cd

/Users/LyubomirKushev

In [3]:
ls

Applications/       Library/            Public/             anaconda3/
Desktop/            Movies/             PycharmProjects/    note uni.txt
Documents/          Music/              Test Scraper.ipynb
Downloads/          Pictures/           VirtualBox VMs/

In [4]:
# files inside data folder 
%ls /Users/LyubomirKushev/Desktop/Data\ Science/Kaggle/Where\ it\ pays\ to\ go\ to\ college/1189_2137_bundle_archive/

degrees-that-pay-back.csv     salaries-by-region.csv
salaries-by-college-type.csv

In [5]:
%cd /Users/LyubomirKushev/Desktop/Data\ Science/Kaggle/Where\ it\ pays\ to\ go\ to\ college/1189_2137_bundle_archive/

/Users/LyubomirKushev/Desktop/Data Science/Kaggle/Where it pays to go to college/1189_2137_bundle_archive

### Degrees that pay back

In [6]:
degrees_pay_back = pd.read_csv("degrees-that-pay-back.csv")

In [7]:
degrees_pay_back.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Percent change from Starting to Mid-Career Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Accounting,"$46,000.00","$77,100.00",67.6,"$42,200.00","$56,100.00","$108,000.00","$152,000.00"
1,Aerospace Engineering,"$57,700.00","$101,000.00",75.0,"$64,300.00","$82,100.00","$127,000.00","$161,000.00"
2,Agriculture,"$42,600.00","$71,900.00",68.8,"$36,300.00","$52,100.00","$96,300.00","$150,000.00"
3,Anthropology,"$36,800.00","$61,500.00",67.1,"$33,800.00","$45,500.00","$89,300.00","$138,000.00"
4,Architecture,"$41,600.00","$76,800.00",84.6,"$50,600.00","$62,200.00","$97,000.00","$136,000.00"

In [8]:
degrees_pay_back.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 8 columns):
Undergraduate Major                                  50 non-null object
Starting Median Salary                               50 non-null object
Mid-Career Median Salary                             50 non-null object
Percent change from Starting to Mid-Career Salary    50 non-null float64
Mid-Career 10th Percentile Salary                    50 non-null object
Mid-Career 25th Percentile Salary                    50 non-null object
Mid-Career 75th Percentile Salary                    50 non-null object
Mid-Career 90th Percentile Salary                    50 non-null object
dtypes: float64(1), object(7)
memory usage: 3.2+ KB

In [10]:
def replacer(string):
    
    """Replaces the characters ['%', '$', ',', '.'] with an empty space so that the object type columns get converter to floats
    
    Input Args: a string with one of the abovementioned characters
    Returns: a string ready to be converted to a float
    """
    
    for ch in ['%', '$', ',', '.']:
        string = string.map(lambda x: x.replace(ch, ''))
    return string

In [11]:
cols = ['Starting Median Salary','Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary', 'Mid-Career 25th Percentile Salary', 'Mid-Career 75th Percentile Salary', 'Mid-Career 90th Percentile Salary']

In [12]:
degrees_pay_back[cols] = degrees_pay_back[cols].apply(replacer) # apply the replaced
degrees_pay_back[cols] = degrees_pay_back[cols].astype('float64') # convert to float
degrees_pay_back[cols] = degrees_pay_back[cols]/100 # because the '.' is removed from the string

In [13]:
degrees_pay_back.describe()

,Starting Median Salary,Mid-Career Median Salary,Percent change from Starting to Mid-Career Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
count,50.000000,50.00000,50.000000,50.000000,50.000000,50.000000,50.000000
mean,44310.000000,74786.00000,69.274000,43408.000000,55988.000000,102138.000000,142766.000000
std,9360.866217,16088.40386,17.909908,12000.779567,13936.951911,20636.789914,27851.249267
min,34000.000000,52000.00000,23.400000,26700.000000,36500.000000,70500.000000,96400.000000
25%,37050.000000,60825.00000,59.125000,34825.000000,44975.000000,83275.000000,124250.000000
50%,40850.000000,72000.00000,67.800000,39400.000000,52450.000000,99400.000000,145500.000000
75%,49875.000000,88750.00000,82.425000,49850.000000,63700.000000,118750.000000,161750.000000
max,74300.000000,107000.00000,103.500000,71900.000000,87300.000000,145000.000000,210000.000000

In [18]:
degrees_pay_back['Undergraduate Major'].describe()

count            50
unique           50
top       Geography
freq              1
Name: Undergraduate Major, dtype: object

### Salaries by college type

In [78]:
salaries_college_type = pd.read_csv("salaries-by-college-type.csv")

In [79]:
salaries_college_type.head()

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Massachusetts Institute of Technology (MIT),Engineering,"$72,200.00","$126,000.00","$76,800.00","$99,200.00","$168,000.00","$220,000.00"
1,California Institute of Technology (CIT),Engineering,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN
2,Harvey Mudd College,Engineering,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN
3,"Polytechnic University of New York, Brooklyn",Engineering,"$62,400.00","$114,000.00","$66,800.00","$94,300.00","$143,000.00","$190,000.00"
4,Cooper Union,Engineering,"$62,200.00","$114,000.00",NaN,"$80,200.00","$142,000.00",NaN

In [80]:
salary_cols = ['Starting Median Salary','Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary', 'Mid-Career 25th Percentile Salary', 'Mid-Career 75th Percentile Salary', 'Mid-Career 90th Percentile Salary']

In [81]:
salaries_college_type[salary_cols] = salaries_college_type[salary_cols].fillna('0')
salaries_college_type[salary_cols] = salaries_college_type[salary_cols].apply(replacer)
salaries_college_type[salary_cols] = salaries_college_type[salary_cols].astype('float64')
salaries_college_type[salary_cols] = salaries_college_type[salary_cols]/100

In [82]:
salaries_college_type.describe()

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
count,269.000000,269.000000,269.000000,269.000000,269.000000,269.000000
mean,46068.401487,83932.342007,37999.628253,60373.234201,116275.092937,135427.509294
std,6412.616242,14336.191107,17426.240075,11381.348857,22952.334054,63789.092095
min,34800.000000,43900.000000,0.000000,31800.000000,60900.000000,0.000000
25%,42000.000000,74000.000000,36600.000000,53200.000000,100000.000000,126000.000000
50%,44700.000000,81600.000000,41600.000000,58400.000000,113000.000000,148000.000000
75%,48300.000000,92200.000000,46400.000000,65100.000000,126000.000000,165000.000000
max,75500.000000,134000.000000,80000.000000,104000.000000,234000.000000,326000.000000

In [83]:
salaries_college_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 269 entries, 0 to 268
Data columns (total 8 columns):
School Name                          269 non-null object
School Type                          269 non-null object
Starting Median Salary               269 non-null float64
Mid-Career Median Salary             269 non-null float64
Mid-Career 10th Percentile Salary    269 non-null float64
Mid-Career 25th Percentile Salary    269 non-null float64
Mid-Career 75th Percentile Salary    269 non-null float64
Mid-Career 90th Percentile Salary    269 non-null float64
dtypes: float64(6), object(2)
memory usage: 16.9+ KB

In [84]:
salaries_region = pd.read_csv("salaries-by-region.csv")

In [85]:
salaries_region.head()

,School Name,Region,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Stanford University,California,"$70,400.00","$129,000.00","$68,400.00","$93,100.00","$184,000.00","$257,000.00"
1,California Institute of Technology (CIT),California,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN
2,Harvey Mudd College,California,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN
3,"University of California, Berkeley",California,"$59,900.00","$112,000.00","$59,500.00","$81,000.00","$149,000.00","$201,000.00"
4,Occidental College,California,"$51,900.00","$105,000.00",NaN,"$54,800.00","$157,000.00",NaN

In [86]:
salaries_region.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 320 entries, 0 to 319
Data columns (total 8 columns):
School Name                          320 non-null object
Region                               320 non-null object
Starting Median Salary               320 non-null object
Mid-Career Median Salary             320 non-null object
Mid-Career 10th Percentile Salary    273 non-null object
Mid-Career 25th Percentile Salary    320 non-null object
Mid-Career 75th Percentile Salary    320 non-null object
Mid-Career 90th Percentile Salary    273 non-null object
dtypes: object(8)
memory usage: 20.1+ KB

In [87]:
region_cols = ['Starting Median Salary','Mid-Career Median Salary','Mid-Career 10th Percentile Salary','Mid-Career 25th Percentile Salary','Mid-Career 75th Percentile Salary','Mid-Career 90th Percentile Salary']

In [88]:
salaries_region[region_cols] = salaries_region[region_cols].fillna('0')
salaries_region[region_cols] = salaries_region[region_cols].apply(replacer)
salaries_region[region_cols] = salaries_region[region_cols].astype('float64')
salaries_region[region_cols] = salaries_region[region_cols]/100
salaries_region.head()

,School Name,Region,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Stanford University,California,70400.0,129000.0,68400.0,93100.0,184000.0,257000.0
1,California Institute of Technology (CIT),California,75500.0,123000.0,0.0,104000.0,161000.0,0.0
2,Harvey Mudd College,California,71800.0,122000.0,0.0,96000.0,180000.0,0.0
3,"University of California, Berkeley",California,59900.0,112000.0,59500.0,81000.0,149000.0,201000.0
4,Occidental College,California,51900.0,105000.0,0.0,54800.0,157000.0,0.0

In [89]:
salaries_region.describe()

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
count,320.000000,320.000000,320.000000,320.000000,320.000000,320.00000
mean,46253.437500,83934.375000,38606.562500,60614.062500,116496.875000,136877.18750
std,6617.038001,15191.443091,17886.421201,11786.436432,24104.265214,66252.79703
min,34500.000000,43900.000000,0.000000,31800.000000,60900.000000,0.00000
25%,42000.000000,73725.000000,37200.000000,53100.000000,99825.000000,125750.00000
50%,45100.000000,82700.000000,42450.000000,59400.000000,113000.000000,149000.00000
75%,48900.000000,93250.000000,47925.000000,66025.000000,129000.000000,171000.00000
max,75500.000000,134000.000000,80000.000000,104000.000000,234000.000000,326000.00000